Ran Plan for dir: `new-project` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
exit status 1: running "atlantis_debug=true /infracost_atlantis_diff.sh" in "/home/atlantis/.atlantis/repos/infracost/atlantis-demo/3/default/new-project": 
#####
Running Infracost atlantis_diff.sh in debug mode, remove atlantis_debug=true from Atlantis configs to disable debug outputs.

Running infracost on current branch using:
  $ infracost --no-color --terraform-dir . --config-file infracost.yml
--config-file flag cannot be used with other project and output flags

NAME:
   infracost - Generate cost estimates from Terraform

USAGE:
   infracost [global options] command [command options] [arguments...]

USAGE METHODS:
  # 1. Use terraform directory with any required terraform flags
  infracost --terraform-dir /path/to/code --terraform-plan-flags "-var-file=myvars.tfvars"

  # 2. Use terraform state file
  infracost --terraform-dir /path/to/code --terraform-use-state

  # 3. Use terraform plan JSON
  terraform plan -out plan.save .
  terraform show -json plan.save > plan.json
  infracost --terraform-json-file /path/to/plan.json

  # 4. Use terraform plan file, relative to terraform-dir
  terraform plan -out plan.save .
  infracost --terraform-dir /path/to/code --terraform-plan-file plan.save

DOCS: https://infracost.io/docs

VERSION:
   v0.7.18

COMMANDS:
   register  Register for an Infracost API key
   report    Create a report from multiple Infracost JSON files
   help, h   Shows a list of commands or help for one command

GLOBAL OPTIONS:
   --log-level value             Log level (trace, debug, info, warn, error, fatal)
   --no-color                    Turn off colored output (default: false)
   --pricing-api-endpoint value  Specify an alternate Cloud Pricing API URL
   --config-file value           Path to the Infracost config file. Cannot be used with other flags
   --terraform-json-file value   Path to Terraform plan JSON file
   --terraform-plan-file value   Path to Terraform plan file relative to 'terraform-dir'
   --terraform-use-state         Use Terraform state instead of generating a plan (default: false)
   --terraform-dir value         Path to the Terraform code directory (default: current working directory)
   --terraform-plan-flags value  Flags to pass to the 'terraform plan' command
   --format value                Output format: json, table, html (default: "table")
   --show-skipped                Show unsupported resources, some of which might be free. Only for table and HTML output format (default: false)
   --usage-file value            Path to Infracost usage file that specifies values for usage-based resources
   --help, -h                    show help (default: false)
   --version                     Prints the version of infracost and terraform (default: false)


An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_instance.instance1 will be created
+ resource "google_compute_instance" "instance1" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = [
          + {
              + count = 4
              + type  = "nvidia-tesla-t4"
            },
        ]
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-32"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "instance1"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = (known after apply)
          + preemptible         = true
        }
    }

  # google_dns_record_set.frontend will be created
+ resource "google_dns_record_set" "frontend" {
      + id           = (known after apply)
      + managed_zone = "zone"
      + name         = "frontend.123"
      + project      = (known after apply)
      + rrdatas      = [
          + "123.123.123.123]",
        ]
      + ttl          = 300
      + type         = "A"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```
</details>

